ab.stacless.log4.txt
This is ApacheBench, Version 2.0.40-dev <$Revision: 1.146 $> apache-2.0
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Copyright 2006 The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            6666

Document Path:          /
Document Length:        37 bytes

Concurrency Level:      50
Time taken for tests:   19.472484 seconds
Complete requests:      100000
Failed requests:        10069
   (Connect: 0, Length: 10069, Exceptions: 0)
Write errors:           0
Total transferred:      8093171 bytes
HTML transferred:       3691411 bytes
Requests per second:    5135.45 [#/sec] (mean)
Time per request:       9.736 [ms] (mean)
Time per request:       0.195 [ms] (mean, across all concurrent requests)
Transfer rate:          405.85 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   1.3      1      14
Processing:     0    8   2.9      8      28
Waiting:        0    6   2.7      6      27
Total:          1    9   2.9      9      28

Percentage of the requests served within a certain time (ms)
  50%      9
  66%     10
  75%     11
  80%     11
  90%     12
  95%     14
  98%     17
  99%     19
 100%     28 (longest request)